tests/pdf-service/load.yml
config:
  environments:
    dev:
      target: 'https://pdf-service.adsp-dev.gov.ab.ca'
    uat:
      target: 'https://pdf-service.adsp-uat.alberta.ca'

  # Processor handles Keycloak authentication & token caching
  processor: ./processor.mjs

  defaults:
    headers:
      Content-Type: 'application/json'
      Accept: 'application/json'

  # CSV payload containing Keycloak + tenant info
  payload:
    - path: '../artillery.{{ $environment }}.csv'
      skipHeader: true
      fields:
        - keycloak_url
        - realm_id
        - tenant_name
        - client_id

  # Load phases
  phases:
    - name: warm up
      duration: 10
      arrivalCount: 20

    - name: load
      duration: 3600
      arrivalCount: 10000

scenarios:
  - name: Create new PDF jobs
    weight: 1
    beforeScenario: beforeScenario

    flow:
      # Create a PDF job using the PDF service endpoint
      - post:
          url: '/pdf/v1/jobs'
          headers:
            authorization: 'Bearer {{ token }}'
          json:
            operation: generate
            templateId: artillery-test
            data: {}
            filename: 'artillery-test.pdf'